{
  "light": "Functions to operate NeoPixel strips.",
  "light.NeoPixelStrip": "A NeoPixel strip",
  "light.colorWheel": "Gets an RGB color given the value of an angle between 0 and 255. Useful\nfor performing math with colors.",
  "light.colorWipeAnimation": "Return a new instance of the color wipe animation",
  "light.colors": "Gets the RGB value of a known color",
  "light.cometAnimation": "Return a new instance of the comet animation",
  "light.createNeoPixelStrip": "Create a new NeoPixel driver for `numleds` LEDs.",
  "light.createNeoPixelStrip|param|numleds": "number of leds in the strip, eg: 24,30,60,64",
  "light.createNeoPixelStrip|param|pin": "the pin where the neopixel is connected.",
  "light.defaultPin": "Gets the default pin for built in neopixels",
  "light.hsv": "Converts an HSV (hue, saturation, value) color to RGB",
  "light.hsv|param|hue": "value of the hue channel between 0 and 255. eg: 255",
  "light.hsv|param|sat": "value of the saturation channel between 0 and 255. eg: 255",
  "light.hsv|param|val": "value of the value channel between 0 and 255. eg: 255",
  "light.rainbowCycleAnimation": "Return a new instance of the rainbow animation",
  "light.rgb": "Converts red, green, blue channels into a RGB color",
  "light.rgb|param|blue": "value of the blue channel between 0 and 255. eg: 255",
  "light.rgb|param|green": "value of the green channel between 0 and 255. eg: 255",
  "light.rgb|param|red": "value of the red channel between 0 and 255. eg: 255",
  "light.runningLightsAnimation": "Return a new instance of the running lights animation",
  "light.sendBuffer": "Sends a neopixel buffer to the specified digital pin",
  "light.sendBuffer|param|buf": "The buffer to send to the pin",
  "light.sendBuffer|param|pin": "The pin that the neopixels are connected to",
  "light.sparkleAnimation": "Return a new instance of the sparkle animation",
  "light.statusLED": "Turns the status LED on or off.",
  "light.statusLED|param|on": "a value indicating if the LED is on",
  "light.theatreChaseAnimation": "Return a new instance of the theatre chase animation"
}